src/main/resources/doSellSsr.text

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.iata.org/IATA/EDIST/2017.2">   <soapenv:Header/>   <soapenv:Body>   <OrderChangeRQ xmlns="http://www.iata.org/IATA/EDIST/2017.2" Version="IATA2017.2">			<Document>				<Name>PC NDC GATEWAY</Name>				<ReferenceVersion>1.0</ReferenceVersion>			</Document>			<Party>				<Sender>               <TravelAgencySender>                  <Contacts>                     <Contact>                        <EmailContact>                           <Address>IATI</Address>                        </EmailContact>                     </Contact>                  </Contacts>                  <AgencyID>IATI</AgencyID>                  <AgentUser>                     <Name>IATI</Name>                     <AgentUserID>T621OC48</AgentUserID>                     <UserRole>ADMIN</UserRole>                  </AgentUser>               </TravelAgencySender>            </Sender></Party><Query>    <OrderID>replaceOrderId</OrderID>    <Payments>        <Payment>            <Type>CC</Type>            <Method>                <PaymentCard>                    <CardNumber>4242424242424242</CardNumber>                    <SeriesCode>4242</SeriesCode>                    <CardHolderName>HOLDER NAME</CardHolderName>                    <EffectiveExpireDate>                        <Expiration>1221</Expiration>                    </EffectiveExpireDate>                </PaymentCard>            </Method>            <Amount Code="TRY">replacePrice</Amount>        </Payment>    </Payments></Query></OrderChangeRQ>  </soapenv:Body></soapenv:Envelope>
